{"head":{"title":"New beginnings","date":"2016-05-10T00:00:00.000Z","layout":"Post","description":"It's been a while since the first commit of the website was pushed to GitHub, on the 26th of June 2015. Since that website launched,…"},"body":"<p>It's been a while since the first commit of the website was pushed to GitHub, on\nthe 26th of June 2015. Since that website launched, cssnano has grown bigger and\nbetter, and what was once a small site has ballooned from something easily\naccessible to something that was in need of a rework. So, as you can probably\ntell from this post, we decided to do just that.</p>\n<p>We've added a new header with navigation links to the most important areas of\nthe site; each page now has section headings with GitHub style anchor links, so\nthat they can be easily linked to from other sites; and finally the\ndocumentation has been brought up to date to cover the most recent release.\nGoing forward, this site will be easier to update as a lot of the pages are\ngenerated dynamically.</p>\n<p>The site itself now uses <a href=\"https://phenomic.io/\">Phenomic</a>, a really great static\nsite generator that uses React components; CSS syntax highlighting is\nprovided by <a href=\"http://midasjs.com\">Midas</a>, which is powered by PostCSS; and, we\nhave also moved the location of the docs directly into the cssnano repository.\nThis was done so that common elements that both the documentation and the main\nrepository share are now in the same location. This allows us to do things like\nputting the <a href=\"/changelog\">changelog</a> on the site!</p>\n<p>If your company uses cssnano and would like to be added to the list of users\ndisplayed on the site, then <a href=\"https://github.com/ben-eb/cssnano/pulls\">please send us a pull request</a> with your\n(preferably SVG) logo in 500x200 format in the <a href=\"https://github.com/ben-eb/cssnano/tree/master/docs/content/assets\"><code>assets</code></a>\ndirectory, and add your details to <a href=\"https://github.com/ben-eb/cssnano/tree/master/docs/users.json\"><code>users.json</code></a>.</p>\n<p>Thanks for reading.</p>\n","__filename":"blog/new-beginnings.md","__url":"/blog/new-beginnings/","__resourceUrl":"/blog/new-beginnings/index.html","__dataUrl":"/blog/new-beginnings/index.html.3ebaafd83e3dcce7b4088f361ec70d12.json"}