{"head":{"title":"Introduction","layout":"Guide","order":1,"description":"What is minification? Minification is the process of taking some code and using various methods to reduce its size on disk. Unlike…"},"body":"<h2 id=\"what-is-minification\"><a href=\"#what-is-minification\" class=\"phenomic-HeadingAnchor\">#</a>What is minification?</h2>\n<p>Minification is the process of taking some code and using various methods to\nreduce its size on disk. Unlike techniques such as gzip, which preserve the\noriginal semantics of the CSS file, and are therefore lossless, minification\nis an inherently lossy process, where values can be replaced with smaller\nequivalents, or selectors merged together, for example.</p>\n<p>The end result of a minification step is that the resulting code will behave\nthe same as the original file, but some parts will be altered to reduce the\nsize as much as possible.</p>\n<p>Combining gzip compression with minification leads to the best reduction in\nfile size; but don't just take our word for it. Why not try out <a href=\"https://npmjs.org/package/css-size\">css-size</a>, a\nmodule especially created to measure CSS size before &#x26; after minification.</p>\n<h2 id=\"what-is-cssnano\"><a href=\"#what-is-cssnano\" class=\"phenomic-HeadingAnchor\">#</a>What is cssnano?</h2>\n<p>cssnano is one such minifier, which is written in <a href=\"https://nodejs.org\">Node.js</a>. It's a <a href=\"http://postcss.org\">PostCSS</a>\nplugin which you can add to your build process, to ensure that the resulting\nstylesheet is as small as possible for a production environment.</p>\n<p>If you don't know what a build process is, don't worry as we cover this in\n<a href=\"/guides/getting-started\">our getting started guide</a>.</p>\n<h2 id=\"how-does-it-benefit-me\"><a href=\"#how-does-it-benefit-me\" class=\"phenomic-HeadingAnchor\">#</a>How does it benefit me?</h2>\n<h3 id=\"numerous-optimisations\"><a href=\"#numerous-optimisations\" class=\"phenomic-HeadingAnchor\">#</a>Numerous optimisations</h3>\n<p>We offer many different optimisations, ranging from simple transforms such as\nwhitespace removal, to complex transforms that can merge identical keyframes\nwith different names. See <a href=\"/guides/presets\">the presets guide</a> for\nmore information.</p>\n<h3 id=\"unified-css-processing\"><a href=\"#unified-css-processing\" class=\"phenomic-HeadingAnchor\">#</a>Unified CSS processing</h3>\n<p>cssnano uses <a href=\"http://postcss.org\">PostCSS</a> to process the CSS under the hood. Because a lot of\nmodern CSS tools use <a href=\"http://postcss.org\">PostCSS</a>, you can compose them together to work on a\nsingle abstract syntax tree (AST). This means that the overall processing\ntime is reduced because the CSS does not have to be parsed multiple times.</p>\n<h3 id=\"modern-architecture--modularity\"><a href=\"#modern-architecture--modularity\" class=\"phenomic-HeadingAnchor\">#</a>Modern architecture &#x26; modularity</h3>\n<p>Because we use <a href=\"http://postcss.org\">PostCSS</a>, we can divide cssnano's responsibilities between many\nplugins, each performing a small optimisation. And many optimisations are scoped\nto a certain subset of CSS properties, which is much safer compared to minifying\nCSS globally using regular expressions.</p>\n","__filename":"guides/index.md","__url":"/guides/","__resourceUrl":"/guides/index.html","__dataUrl":"/guides/index.html.c9e937eb288a2674b39ee3afc3032724.json"}