{"head":{"title":"Contributing","layout":"Guide","order":6,"description":"Thanks for contributing to cssnano! We appreciate any contributions, large or small. If you've contributed to cssnano we would recommend…"},"body":"<!-- This file was automatically generated. -->\n<p>Thanks for contributing to cssnano! We appreciate any contributions,\nlarge or small. If you've contributed to cssnano we would recommend that\nyou add yourself to the list of contributors, found in <a href=\"https://github.com/ben-eb/cssnano/blob/master/CONTRIBUTORS.md\">CONTRIBUTORS.md</a>.</p>\n<p>To do this, after you've set up the development environment, run:</p>\n<pre><code>all-contributors add\n</code></pre>\n<p>And follow the on-screen prompts.</p>\n<h2 id=\"how-can-i-contribute-to-cssnanos-code\"><a href=\"#how-can-i-contribute-to-cssnanos-code\" class=\"phenomic-HeadingAnchor\">#</a>How can I contribute to cssnano's code?</h2>\n<p>Since version 4, we now develop in a <a href=\"https://github.com/lerna/lerna\">Lerna</a>\nmonorepo. This is because a lot of transforms overlap with each other; it's\neasier to test them together. Other than this, you'll need Node.js, npm &#x26;\ngit installed. Then, you can run these commands to get the repository set up:</p>\n<pre><code>git clone git@github.com:ben-eb/cssnano.git\ncd cssnano\nnpm install\n</code></pre>\n<p>You can run the tests with:</p>\n<pre><code>npm test\n</code></pre>\n<p>We recommend that you look in the issue tracker to find anything tagged\n<a href=\"https://github.com/ben-eb/cssnano/labels/help%20wanted\">help wanted</a>; that's the first port of call for getting stuck\nin and writing code. If there's any other open issues that you think you can\ntackle, please comment on the thread expressing your interest.</p>\n<p>If you have an idea for some functionality which doesn't have an issue tracking\nit, then please open an issue before writing a pull request. We find it more\nhelpful to discuss your requirements before writing any code.</p>\n<h3 id=\"documentation\"><a href=\"#documentation\" class=\"phenomic-HeadingAnchor\">#</a>Documentation</h3>\n<p>The documentation website is also included with the repository, under <code>/docs</code>.\nIt runs <a href=\"https://phenomic.io\">phenomic</a> and requires a separate <code>npm install</code>\nto pull down the dependencies. You can then browse the documentation locally\nby running <code>npm start</code>.</p>\n<p>Note that some of the documentation is automatically generated and should not\nbe edited by hand.</p>\n<h2 id=\"are-there-other-ways-of-contributing\"><a href=\"#are-there-other-ways-of-contributing\" class=\"phenomic-HeadingAnchor\">#</a>Are there other ways of contributing?</h2>\n<p>Absolutely! Try any of the following areas:</p>\n<h3 id=\"improve-our-documentation\"><a href=\"#improve-our-documentation\" class=\"phenomic-HeadingAnchor\">#</a>Improve our documentation</h3>\n<p>If there's something in our documentation that you think needs spell checking,\nclearing up, additional code examples, or could be made better in some way,\nhelp us by opening an issue detailing the problem.</p>\n<p>Use the <a href=\"https://github.com/ben-eb/cssnano/labels/documentation\">documentation label</a> to find relevant issues.</p>\n<h3 id=\"improve-our-issues\"><a href=\"#improve-our-issues\" class=\"phenomic-HeadingAnchor\">#</a>Improve our issues</h3>\n<p>Issues are like a secondary means of documenting the project, and in cases where\nan issue is missing reproduction steps, please help us by co-ordinating with\nthe original author to find out more details about their problem.</p>\n<p>Once the source of the error has been found, you can be of further help by\nsubmitting a failing test case as a pull request. Many of our tests follow a\nsimple <code>fixture</code> &#x26; <code>expected</code> string comparison pattern.</p>\n<h3 id=\"send-feedback-on-issues\"><a href=\"#send-feedback-on-issues\" class=\"phenomic-HeadingAnchor\">#</a>Send feedback on issues</h3>\n<p>Feedback on issues is very important and will shape the direction of cssnano.\nPlease help us by leaving constructive criticism on issues that matter to you,\nand especially on issues labelled \"<a href=\"https://github.com/ben-eb/cssnano/labels/question\">question</a>\".</p>\n<p>Note that we don't find \"+1\" comments to be very helpful; instead, use GitHub\nreactions and subscribe to the thread to be notified of any progress. This helps\nto keep our discourse focused on the topic at hand.</p>\n<h3 id=\"review-pull-requests\"><a href=\"#review-pull-requests\" class=\"phenomic-HeadingAnchor\">#</a>Review pull requests</h3>\n<p>It's really important to get more eyes on upcoming features and fixes. Please\nhelp by reviewing pull requests; even leaving a thumbs up reaction is better\nthan nothing at all. Helping us to review means less time is wasted by all of\nus if a buggy release is cut.</p>\n<h3 id=\"talk-with-us\"><a href=\"#talk-with-us\" class=\"phenomic-HeadingAnchor\">#</a>Talk with us!</h3>\n<p>We have an <a href=\"https://gitter.im/postcss/postcss\">online chat</a> where you can ask questions or discuss features;\nhelp us by joining the chat, and answer any questions that the community may\nhave. Feel free to ask any questions of your own!</p>\n<h2 id=\"how-you-can-support-us\"><a href=\"#how-you-can-support-us\" class=\"phenomic-HeadingAnchor\">#</a>How you can support us</h2>\n<p>If you don't have time to contribute to the project directly, you can also\nhelp us out by starring the repository, or <a href=\"https://twitter.com/cssnano_\">follow us on Twitter</a>.\nWord of mouth really does mean a lot to us!</p>\n<p>You can also help support us financially by purchasing stickers from our\n<a href=\"https://www.stickermule.com/uk/marketplace/11086-cssnano\">sticker shop</a>.</p>\n","__filename":"guides/contributing.md","__url":"/guides/contributing/","__resourceUrl":"/guides/contributing/index.html","__dataUrl":"/guides/contributing/index.html.7ef1dc3fbdb000539a11d0f0792e5806.json"}